---
type: BalusterPattern
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 13
tags: [revit-api, class]
---

# BalusterPattern

`Autodesk.Revit.DB.Architecture.BalusterPattern` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | DuplicateBaluster | 2019 | `public BalusterInfo DuplicateBaluster ( int index )` |
| Method | GetBaluster | 2019 | `public BalusterInfo GetBaluster ( int index )` |
| Method | GetBalusterCount | 2019 | `public int GetBalusterCount ()` |
| Method | RemoveBaluster | 2019 | `public void RemoveBaluster ( int index )` |
| Property | BreakPattern | 2019 | `public BreakPatternCondition BreakPattern { get ; set ; }` |
| Property | DistributionJustification | 2019 | `public PatternJustification DistributionJustification { get ; set ; }` |
| Property | EndSpace | 2019 | `public double EndSpace { get ; set ; }` |
| Property | ExcessLengthFillBalusterId | 2019 | `public ElementId ExcessLengthFillBalusterId { get ; set ; }` |
| Property | ExcessLengthFillSpacing | 2019 | `public double ExcessLengthFillSpacing { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Length | 2019 | `public double Length { get ; }` |
| Property | PatternAngle | 2019 | `public double PatternAngle { get ; set ; }` |